## Production: glue 🧴
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 3 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                              NAME                               |
|--------|-----------------------------------------------------------------|
| add    | `aws_glue_catalog_database.operations_qualtrics_production`     |
|        | `aws_glue_catalog_database.operations_qualtrics_production_raw` |
|        | `aws_glue_crawler.operations_qualtrics_postsupport`             |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_glue_catalog_database.operations_qualtrics_production will be created
  + resource "aws_glue_catalog_database" "operations_qualtrics_production" {
      + arn          = (known after apply)
      + catalog_id   = (known after apply)
      + description  = "TRANSFORMED: data source path: /operations/qualtrics/*"
      + id           = (known after apply)
      + location_uri = (known after apply)
      + name         = "operations_qualtrics_production"
      + region       = "ca-central-1"
      + tags_all     = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }

      + create_table_default_permission (known after apply)
    }

  # aws_glue_catalog_database.operations_qualtrics_production_raw will be created
  + resource "aws_glue_catalog_database" "operations_qualtrics_production_raw" {
      + arn          = (known after apply)
      + catalog_id   = (known after apply)
      + description  = "RAW: data source path: /operations/qualtrics/*"
      + id           = (known after apply)
      + location_uri = (known after apply)
      + name         = "operations_qualtrics_production_raw"
      + region       = "ca-central-1"
      + tags_all     = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }

      + create_table_default_permission (known after apply)
    }

  # aws_glue_crawler.operations_qualtrics_postsupport will be created
  + resource "aws_glue_crawler" "operations_qualtrics_postsupport" {
      + arn                    = (known after apply)
      + configuration          = jsonencode(
            {
              + CrawlerOutput = {
                  + Partitions = {
                      + AddOrUpdateBehavior = "InheritFromTable"
                    }
                  + Tables     = {
                      + AddOrUpdateBehavior = "MergeNewColumns"
                    }
                }
              + Version       = 1
            }
        )
      + database_name          = "operations_qualtrics_production"
      + description            = "Classify the Qualtrics PostSupport survey data"
      + id                     = (known after apply)
      + name                   = "Operations / Qualtrics / PostSupport"
      + region                 = "ca-central-1"
      + role                   = "arn:aws:iam::739275439843:role/service-role/AWSGlueCrawler-DataLake"
      + schedule               = "cron(0 6 * * ? *)"
      + security_configuration = "encryption-at-rest"
      + table_prefix           = "operations_qualtrics_postsupport_"
      + tags                   = {
          + "CostCentre" = "PlatformDataLake"
        }
      + tags_all               = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }

      + s3_target {
          + path = "s3://cds-data-lake-raw-production/operations/qualtrics/forms/"
        }
      + s3_target {
          + path = "s3://cds-data-lake-raw-production/operations/qualtrics/gcds/"
        }
      + s3_target {
          + path = "s3://cds-data-lake-raw-production/operations/qualtrics/notify/"
        }

      + schema_change_policy {
          + delete_behavior = "DELETE_FROM_DATABASE"
          + update_behavior = "UPDATE_IN_DATABASE"
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.bes_crm_salesforce_production"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.bes_strategic_data_production"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.bes_strategic_data_production_raw"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.operations_aws_production"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.operations_aws_production_raw"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.operations_github_production"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.operations_github_production_raw"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.operations_google_analytics_production"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.operations_google_analytics_production_raw"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.operations_qualtrics_production"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.operations_qualtrics_production_raw"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.platform_gc_design_system"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.platform_gc_forms_production"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.platform_gc_forms_production_raw"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.platform_gc_notify_production"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.platform_gc_notify_production_curated"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.platform_support_production"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.platform_support_production_raw"]
WARN - plan.json - main - Missing...
```

</details>
